In [1]:
%CREATE sqlite3 test.db

In [2]:
CREATE TABLE test (Key STRING, Value INTEGER)

In [3]:
SELECT * FROM test

+-----+-------+
| Key | Value |
+-----+-------+

In [4]:
INSERT INTO test (Key, Value) VALUES ("Test", 123), ("tseT", 321)

In [5]:
SELECT * FROM test

+------+-------+
| Key  | Value |
+------+-------+
| Test | 123   |
+------+-------+
| tseT | 321   |
+------+-------+

In [6]:
DELETE FROM test WHERE Value = 123

In [7]:
SELECT * FROM test

+------+-------+
| Key  | Value |
+------+-------+
| tseT | 321   |
+------+-------+

In [8]:
%DELETE test.db